vlm/extension/Enums/ВидыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПриобретениеУслугПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМестИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Оплата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПунктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеВыполняет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсполнителейЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/CommonModules/ДоставкаТоваров/Ext/Module.bsl
&ИзменениеИКонтроль("ДобавитьИзменитьПунктПоРеквизитамДоставки")
Функция бит_ДобавитьИзменитьПунктПоРеквизитамДоставки(КоллекцияМаршрут, РеквизитыДоставки, ДатаВремяРейсаПланС)
	
	#Удаление
	СтруктураРеквизиты = Новый Структура("Адрес, АдресДоставки, АдресЗначенияПолей, Зона, ЗонаДоставки, ДополнительнаяИнформация, ДополнительнаяИнформацияПоДоставке, Вес, Объем, ВремяС, ВремяПо");
	#КонецУдаления
	#Вставка
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:41:11] +
	СтруктураРеквизиты = Новый Структура("Адрес, АдресДоставки, АдресЗначенияПолей, Зона, ЗонаДоставки, ДополнительнаяИнформация, ДополнительнаяИнформацияПоДоставке, Вес, Объем, ВремяС, ВремяПо, бит_КоличествоМест");
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:41:13] -
	#КонецВставки
	ЗаполнитьЗначенияСвойств(СтруктураРеквизиты, РеквизитыДоставки);
	СтруктураРеквизиты.Адрес = ?(ЗначениеЗаполнено(СтруктураРеквизиты.АдресДоставки),СтруктураРеквизиты.АдресДоставки, СтруктураРеквизиты.Адрес);
	СтруктураРеквизиты.Зона = ?(ЗначениеЗаполнено(СтруктураРеквизиты.ЗонаДоставки),СтруктураРеквизиты.ЗонаДоставки, СтруктураРеквизиты.Зона);
	СтруктураРеквизиты.ДополнительнаяИнформация = ?(ЗначениеЗаполнено(СтруктураРеквизиты.ДополнительнаяИнформацияПоДоставке),СтруктураРеквизиты.ДополнительнаяИнформацияПоДоставке, СтруктураРеквизиты.ДополнительнаяИнформация);

	АдресСравнения = Врег(СокрЛП(СтруктураРеквизиты.Адрес));
	АдресСравнения = СтрЗаменить(АдресСравнения," ","");

	Для Каждого СтрокаМаршрута Из КоллекцияМаршрут Цикл

		АдресСравненияМаршрут = СтрЗаменить(Врег(СокрЛП(СтрокаМаршрута.Адрес))," ","");

		Если АдресСравнения = АдресСравненияМаршрут Тогда

			СтрокаМаршрута.Вес = СтрокаМаршрута.Вес + СтруктураРеквизиты.Вес;
			СтрокаМаршрута.Объем = СтрокаМаршрута.Объем + СтруктураРеквизиты.Объем;
			СтрокаМаршрута.ДополнительнаяИнформация = ДополнитьТекстРаспоряжениемИДопИнфо(СтрокаМаршрута.ДополнительнаяИнформация,
			СтруктураРеквизиты.ДополнительнаяИнформация,РеквизитыДоставки.Распоряжение);

			Возврат СтрокаМаршрута;

		КонецЕсли;

	КонецЦикла;

	СтрокаМаршрута = КоллекцияМаршрут.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаМаршрута, СтруктураРеквизиты);
	СтрокаМаршрута.КлючСвязи = Новый УникальныйИдентификатор;

	СтрокаМаршрута.ДополнительнаяИнформация = ДополнитьТекстРаспоряжениемИДопИнфо(
	"", СтруктураРеквизиты.ДополнительнаяИнформация,РеквизитыДоставки.Распоряжение);

	Если КоллекцияМаршрут.Количество() = 1 Тогда

		СтрокаМаршрута.ВремяС = ДатаВремяРейсаПланС;
		СтрокаМаршрута.ВремяПо = СтрокаМаршрута.ВремяС;

	Иначе

		СтрокаМаршрута.ВремяС = КоллекцияМаршрут[КоллекцияМаршрут.Индекс(СтрокаМаршрута) - 1].ВремяПо;
		СтрокаМаршрута.ВремяПо = СтрокаМаршрута.ВремяС;

	КонецЕсли;

	Если ТипЗнч(КоллекцияМаршрут) = Тип("ДанныеФормыКоллекция") Тогда
		СтрокаМаршрута.ВремяСБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);
	КонецЕсли;

	Возврат СтрокаМаршрута;

КонецФункции

&ИзменениеИКонтроль("ОбновитьСписокРаспоряженийНаДоставку")
Процедура бит_ОбновитьСписокРаспоряженийНаДоставку1(Форма, ОбновляемыеРаспоряжения)

	ДопустимоеОтклонениеПроцент = Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();

	РаспоряженияНаДоставку 		= Форма.РаспоряженияНаДоставку;
	ТоварыРаспоряженийКДоставке = Форма.ТоварыРаспоряженийКДоставке;
	ОтборПоТипуИсполнителей 	= Форма.ОтборПоТипуИсполнителей;
	Зона 						= Форма.Зона; // СправочникСсылка.ЗоныДоставки
	Склад 						= Форма.Склад; // СправочникСсылка.Склады
	ДатаРаспоряжений 			= Форма.ДатаРаспоряжений; // Дата
	ЗонаГруппаИлиПустая 		= НЕ ЗначениеЗаполнено(Зона) ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Зона,"ЭтоГруппа");

	ВыборочноеОбновление = (ОбновляемыеРаспоряжения <> Неопределено);

	ВесОбъемРаспоряженийПоДатам = Новый ТаблицаЗначений;
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Вес", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Объем", ОбщегоНазначения.ОписаниеТипаЧисло(18,6));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
    #Вставка
	ВесОбъемРаспоряженийПоДатам.Колонки.Добавить("бит_КоличествоМест", ОбщегоНазначения.ОписаниеТипаЧисло(5,0));
	#КонецВставки
	
	КешДобавляемыхСтрок = Новый Массив;

	КоллекцияРаспоряжений = РаспоряженияНаДоставку.ПолучитьЭлементы();
	ВесОбъем = Новый Структура;

	Если Не ВыборочноеОбновление Тогда
		ВесОбъем.Вставить("ИтогоВес", 0);
		ВесОбъем.Вставить("ИтогоОбъем",0);
		КоллекцияРаспоряжений.Очистить();
		ТоварыРаспоряженийКДоставке.Очистить();
	Иначе
		СтруктураПоиска = Новый Структура("Склад, Распоряжение");

		Для Каждого Стр Из ОбновляемыеРаспоряжения Цикл

			// При выборочном обновлении сначала нужно удалить строки обновляемых распоряжений,
			// для этого воспользуемся списком товаров по распоряжениям.
			ПредыдущийИдентификатор = Неопределено;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Стр);

			НайденныеСтроки = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаТовары Из НайденныеСтроки Цикл
				Идентификатор = СтрокаТовары.ИдентификаторВДеревеРаспоряжений;
				Если ПредыдущийИдентификатор = Идентификатор
					Или Не ЗначениеЗаполнено(Идентификатор) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаРаспоряжение = РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор);
				Если СтрокаРаспоряжение <> Неопределено Тогда
					Если ЗонаГруппаИлиПустая Тогда
						ТекущаяВетка = СтрокаРаспоряжение.ПолучитьРодителя();
						КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
						// Если удаляем последний элемент в ветке, удалим родителя.
						Если КоллекцияТекущаяВетка.Количество() = 1 Тогда
							КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
						Иначе
							ТекущаяВетка.Вес = ТекущаяВетка.Вес - СтрокаРаспоряжение.Вес;
							ТекущаяВетка.Объем = ТекущаяВетка.Объем - СтрокаРаспоряжение.Объем;
							#Вставка
							// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:39] +
							ТекущаяВетка.бит_КоличествоМест = СтрокаРаспоряжение.бит_КоличествоМест;
							// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:41] -
							#КонецВставки
							КоллекцияТекущаяВетка.Удалить(СтрокаРаспоряжение);
						КонецЕсли;
					Иначе
						КоллекцияРаспоряжений.Удалить(СтрокаРаспоряжение);
					КонецЕсли;
				КонецЕсли;
				ТоварыРаспоряженийКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	СтруктураЗадание = Новый Структура("ЗаданиеНаПеревозку", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураЗадание, Форма);

	Запрос = Новый Запрос;
	ИсходящаяДоставка = Форма.ВидДоставки = Перечисления.ВидыДоставки.СоСклада;

	ЕстьОрдерныйНаОтгрузкуСклад      = Ложь;
	ЕстьНеОрдерныйНаОтгрузкуСклад    = Ложь;
	ЕстьОрдерныйНаПоступлениеСклад   = Ложь;
	ЕстьНеОрдерныйНаПоступлениеСклад = Ложь;

	Если ИсходящаяДоставка Тогда
		ЕстьОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьОрдерныйНаОтгрузкуСклад(Склад);
		ЕстьНеОрдерныйНаОтгрузкуСклад = СкладыСервер.ЕстьНеОрдерныйНаОтгрузкуСклад(Склад);
	Иначе
		ЕстьОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьОрдерныйНаПоступлениеСклад(Склад);
		ЕстьНеОрдерныйНаПоступлениеСклад = СкладыСервер.ЕстьНеОрдерныйНаПоступлениеСклад(Склад);
	КонецЕсли;

	ТекстЗапроса = "";
	Если ИсходящаяДоставка Тогда

		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
		ЕстьОрдерныйНаОтгрузкуСклад,
		ЕстьНеОрдерныйНаОтгрузкуСклад,
		Истина);

		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиКПолучателю", СпособыДоставкиНашимиСиламиКПолучателю());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомКПолучателю", СпособыДоставкиПеревозчикомКПолучателю());

	Иначе

		ТекстЗапроса = ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление,
		ЕстьОрдерныйНаПоступлениеСклад,
		ЕстьНеОрдерныйНаПоступлениеСклад,
		Ложь);

		Запрос.УстановитьПараметр("ДатаОтбора", НачалоДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("СпособыДоставкиНашимиСиламиОтОтправителя", СпособыДоставкиНашимиСиламиОтОтправителя());
		Запрос.УстановитьПараметр("СпособыДоставкиПеревозчикомОтОтправителя", СпособыДоставкиПеревозчикомОтОтправителя());

	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	БезОтбораПоЗоне = Зона = Справочники.ЗоныДоставки.ПустаяСсылка();

	Запрос.УстановитьПараметр("Зона",                              Зона);
	Запрос.УстановитьПараметр("Склад",                             Склад);
	Запрос.УстановитьПараметр("БезОтбораПоЗоне",                   БезОтбораПоЗоне);
	Запрос.УстановитьПараметр("ОбновляемыеРаспоряжения",           ОбновляемыеРаспоряжения);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПодбор",          СтруктураЗадание.ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозкуПустаяСсылка",    Документы.ЗаданиеНаПеревозку.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусЗаданияЗакрыто",              Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	Запрос.УстановитьПараметр("ОтборПоТипуИсполнителей",           ОтборПоТипуИсполнителей);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса",                 ТекущаяДатаСеанса());

	Пакет = Запрос.ВыполнитьПакет();
	РезультатЗапроса = Пакет[Пакет.ВГраница()-1]; // РезультатЗапроса
	ДвиженияКРаспределению = РезультатЗапроса.Выгрузить();

	ПоляОтбораДвижений = Новый Массив(); // Массив из Строка
	ПоляОтбораДвижений.Добавить("Распоряжение");
	ПоляОтбораДвижений.Добавить("Склад");
	ПоляОтбораДвижений.Добавить("Номенклатура");
	ПоляОтбораДвижений.Добавить("Характеристика");
	ПоляОтбораДвижений.Добавить("Назначение");
	Если ДвиженияКРаспределению.Колонки.Найти("Серия") <> Неопределено Тогда
		ПоляОтбораДвижений.Добавить("Серия");
	КонецЕсли;
	ПоляОтбораДвиженийКРаспределению = СтрСоединить(ПоляОтбораДвижений, ",");

	Если ИсходящаяДоставка
		Или ЕстьОрдерныйНаПоступлениеСклад Тогда
		ДвиженияКРаспределению.Индексы.Добавить(ПоляОтбораДвиженийКРаспределению);
	КонецЕсли;

	РезультатЗапроса = Пакет[Пакет.ВГраница()]; // РезультатЗапроса
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.СледующийПоЗначениюПоля("Зона") Цикл

		Если ВыборочноеОбновление Тогда

		ИначеЕсли ЗонаГруппаИлиПустая Тогда
			ТекущаяВетка = КоллекцияРаспоряжений.Добавить();
			ТекущаяВетка.Адрес = Строка(Выборка.Зона);
			ТекущаяВетка.Зона = Выборка.Зона;
			КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
		Иначе
			КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
		КонецЕсли;

		ВесПоЗоне = 0;
		ОбъемПоЗоне = 0;

		Пока Выборка.СледующийПоЗначениюПоля("Распоряжение") Цикл

			Если ВыборочноеОбновление Тогда
				СтруктураЗонаАдрес = Новый Структура("Зона, Адрес");
				ЗаполнитьЗначенияСвойств(СтруктураЗонаАдрес, Выборка);
				ПозицияДляВставки = ПолучитьПозициюДляВставки(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая, СтруктураЗонаАдрес);
				Если ЗонаГруппаИлиПустая Тогда
					ТекущаяВетка = КоллекцияРаспоряжений[ПозицияДляВставки.Зона];
					КоллекцияТекущаяВетка = ТекущаяВетка.ПолучитьЭлементы();
				Иначе
					КоллекцияТекущаяВетка = КоллекцияРаспоряжений;
				КонецЕсли;
				ПозицияДляВставки = ПозицияДляВставки.Распоряжение;
			КонецЕсли;

			Если Выборка.ВидРаспоряжения = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда

				Если ЗначениеЗаполнено(ДатаРаспоряжений)
					И ЗначениеЗаполнено(Выборка.Дата)
					И НачалоДня(Выборка.Дата) > ДатаРаспоряжений Тогда
					Продолжить;
				КонецЕсли;

				Если ВыборочноеОбновление Тогда
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
					ПозицияДляВставки = ПозицияДляВставки + 1;
				Иначе
					СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);
				СтрокаРаспоряжение.ПолучательОтправительПредставление = Выборка.ПолучательОтправитель;
				СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(Выборка.ВремяС, Выборка.ВремяПо);
				#Вставка
				// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:39] +
				СтрокаРаспоряжение.бит_КоличествоМест = бит_ПолучитьКоличествоМест(СтрокаРаспоряжение.Распоряжение);
				// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:41] -
				#КонецВставки

				СтрокаДляХраненияИдентификатора = ТоварыРаспоряженийКДоставке.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляХраненияИдентификатора, Выборка);
				СтрокаДляХраненияИдентификатора.ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();

				Продолжить;

			КонецЕсли;

			Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл

				Номенклатура = Неопределено;
				Характеристика = Неопределено;
				Назначение = Неопределено;
				Серия = Неопределено;

				ВесОбъемРаспоряженийПоДатам.Очистить();
				КешДобавляемыхСтрок.Очистить();
				ПотребностьПоТовару = 0;
				ПроверитьОтклонение = Ложь;

				Пока Выборка.Следующий() Цикл

					Если Номенклатура <> Выборка.Номенклатура
						ИЛИ Характеристика <> Выборка.Характеристика
						ИЛИ Назначение <> Выборка.Назначение
						ИЛИ Серия <> Выборка.Серия Тогда
						// перешли к другому товару

						Номенклатура = Выборка.Номенклатура;
						Характеристика = Выборка.Характеристика;
						Назначение = Выборка.Назначение;
						Серия = Выборка.Серия;

						Если ПроверитьОтклонение Тогда
							ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
							// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
							Для Каждого Стр Из КешДобавляемыхСтрок Цикл
								Если Стр.Количество <= ДопустимоеОтклонение Тогда
									ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						КешДобавляемыхСтрок.Очистить();
						ПотребностьПоТовару = 0;

						ПроверитьОтклонение = Выборка.МернаяЕдиницаИзмерения И ДопустимоеОтклонениеПроцент > 0;

					КонецЕсли;

					Если ИсходящаяДоставка Тогда

						ОсталосьРаспределить = Выборка.Количество;

						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл
							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;
							СтрокаДетальныхДанных.Количество = СтрокаДетальныхДанных.Количество - Списываем;

							Если ОсталосьРаспределить = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;

						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить * (Выборка.Вес / Выборка.Количество);
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить * (Выборка.Объем / Выборка.Количество);
                            #Вставка
							// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [25.06.2025 14:48:34] +
							ТекущаяСтрокаВесОбъем.бит_КоличествоМест =  бит_ПолучитьКоличествоМест(Выборка.Распоряжение); 
							// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [25.06.2025 14:48:36] -
							#КонецВставки
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
							ПотребностьПоТовару = ПотребностьПоТовару + ОсталосьРаспределить;
						КонецЕсли;

					ИначеЕсли Не ЕстьОрдерныйНаПоступлениеСклад Тогда

						ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
						ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка);
						КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;

					Иначе

						ПараметрыОтбора = Новый Структура(ПоляОтбораДвиженийКРаспределению);
						ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
						ДетальныеДанные = ДвиженияКРаспределению.НайтиСтроки(ПараметрыОтбора);

						ОсталосьРаспределить = Выборка.Количество;
						// Распределение товаров по датам поступления;
						Для Каждого СтрокаДетальныхДанных Из ДетальныеДанные Цикл

							Списываем = Мин(ОсталосьРаспределить, СтрокаДетальныхДанных.Количество);
							ОсталосьРаспределить = ОсталосьРаспределить - Списываем;

							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = СтрокаДетальныхДанных.Период;
							ТекущаяСтрокаВесОбъем.Количество = Списываем;
							ТекущаяСтрокаВесОбъем.Вес = Списываем * СтрокаДетальныхДанных.Вес / СтрокаДетальныхДанных.Количество;
							ТекущаяСтрокаВесОбъем.Объем = Списываем * СтрокаДетальныхДанных.Объем / СтрокаДетальныхДанных.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);

							Если ОсталосьРаспределить <= 0 Тогда
								Прервать;
							КонецЕсли;

						КонецЦикла;

						Если ОсталосьРаспределить > 0 Тогда
							ТекущаяСтрокаВесОбъем = ВесОбъемРаспоряженийПоДатам.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаВесОбъем, Выборка,,"Количество,Вес,Объем");
							ТекущаяСтрокаВесОбъем.Дата = НачалоДня(ТекущаяДатаСеанса());
							ТекущаяСтрокаВесОбъем.Количество = ОсталосьРаспределить;
							ТекущаяСтрокаВесОбъем.Вес = ОсталосьРаспределить 	* Выборка.Вес 	/ Выборка.Количество;
							ТекущаяСтрокаВесОбъем.Объем = ОсталосьРаспределить 	* Выборка.Объем / Выборка.Количество;
							КешДобавляемыхСтрок.Добавить(ТекущаяСтрокаВесОбъем);
						КонецЕсли;
						ПотребностьПоТовару = ПотребностьПоТовару + Выборка.Количество;
					КонецЕсли;
				КонецЦикла;

				// Нужно проверить последний добавленный товар распоряжения;
				Если ПроверитьОтклонение Тогда
					ДопустимоеОтклонение = ДопустимоеОтклонениеПроцент/100 * ПотребностьПоТовару;
					// Не нужно выводить строки с мерным товаром, если остаток к доставке не превысил допустимое отклонение;
					Для Каждого Стр Из КешДобавляемыхСтрок Цикл
						Если Стр.Количество <= ДопустимоеОтклонение Тогда
							ВесОбъемРаспоряженийПоДатам.Удалить(Стр);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;

				ВесОбъемРаспоряженийПоДатам.Сортировать("Дата");

				ТекущаяДата = Неопределено;

				Для Каждого СтрокаВесОбъемДата Из ВесОбъемРаспоряженийПоДатам Цикл

					Если ЗначениеЗаполнено(ДатаРаспоряжений)
						И СтрокаВесОбъемДата.Дата > ДатаРаспоряжений Тогда
						Прервать;
					КонецЕсли;

					СтрокаТовар = ТоварыРаспоряженийКДоставке.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовар, Выборка);
					ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаВесОбъемДата);

					Если ТекущаяДата <> СтрокаВесОбъемДата.Дата Тогда

						ТекущаяДата = СтрокаВесОбъемДата.Дата;

						Если ВыборочноеОбновление Тогда
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Вставить(ПозицияДляВставки);
							ПозицияДляВставки = ПозицияДляВставки + 1;
						Иначе
							СтрокаРаспоряжение = КоллекцияТекущаяВетка.Добавить();
						КонецЕсли;

						ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, Выборка);

						Если СтрокаРаспоряжение.Свойство("АдресДоставкиЗначенияПолей") Тогда
							СтрокаРаспоряжение.АдресДоставкиЗначенияПолей = Выборка.АдресЗначенияПолей;
						КонецЕсли;

						СтрокаРаспоряжение.Дата = ТекущаяДата;
						СтрокаРаспоряжение.Вес = 0;
						СтрокаРаспоряжение.Объем = 0;

						СтрокаРаспоряжение.ПолучательОтправительПредставление = ДоставкаТоваровКлиентСервер.ПредставлениеПолучателяОтправителя(
						Выборка.ПолучательОтправитель, Выборка.Перевозчик, Форма.ВидДоставки);
						СтрокаРаспоряжение.Время = ДоставкаТоваровКлиентСервер.ПредставлениеВремениДоставки(
						Выборка.ВремяС, Выборка.ВремяПо);

						ИдентификаторВДеревеРаспоряжений = СтрокаРаспоряжение.ПолучитьИдентификатор();

					КонецЕсли;

					СтрокаТовар.ИдентификаторВДеревеРаспоряжений = ИдентификаторВДеревеРаспоряжений;

					СтрокаРаспоряжение.Вес = СтрокаРаспоряжение.Вес + СтрокаВесОбъемДата.Вес;
					СтрокаРаспоряжение.Объем = СтрокаРаспоряжение.Объем + СтрокаВесОбъемДата.Объем;
					#Вставка
					// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:39] +
					СтрокаРаспоряжение.бит_КоличествоМест = СтрокаВесОбъемДата.бит_КоличествоМест;
					// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [20.06.2025 17:32:41] -
					#КонецВставки

					ВесПоЗоне   = ВесПоЗоне   + СтрокаВесОбъемДата.Вес;
					ОбъемПоЗоне = ОбъемПоЗоне + СтрокаВесОбъемДата.Объем;

				КонецЦикла;

			КонецЦикла; // Склад
		КонецЦикла; // Распоряжение

		Если Не ВыборочноеОбновление Тогда
			ВесОбъем.ИтогоВес = ВесОбъем.ИтогоВес + ВесПоЗоне;
			ВесОбъем.ИтогоОбъем = ВесОбъем.ИтогоОбъем  + ОбъемПоЗоне;
		КонецЕсли;

		Если ЗонаГруппаИлиПустая Тогда

			Если КоллекцияТекущаяВетка.Количество() = 0 Тогда
				КоллекцияРаспоряжений.Удалить(ТекущаяВетка);
			Иначе
				Если ВыборочноеОбновление Тогда
					ТекущаяВетка.Вес   = ТекущаяВетка.Вес + ВесПоЗоне;
					ТекущаяВетка.Объем = ТекущаяВетка.Объем + ОбъемПоЗоне;
				Иначе
					ТекущаяВетка.Вес   = ВесПоЗоне;
					ТекущаяВетка.Объем = ОбъемПоЗоне;
				КонецЕсли;
				ТекущаяВетка.ОформлениеСтроки = 5;
				ТекущаяВетка.Зона = Выборка.Зона;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;

	КонецЦикла; // Зона

	ЗаполнитьЗначенияСвойств(Форма, ВесОбъем);
	ЗаполнитьПризнакиОформленияРаспоряжений(РаспоряженияНаДоставку, ЗонаГруппаИлиПустая);

КонецПроцедуры   

&НаСервере
Функция бит_ПолучитьКоличествоМест(бит_Распоряжение)
// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 13:49:35] +	

	Если ТипЗнч(бит_Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.бит_КоличествоМест) КАК бит_КоличествоМест
		|ИЗ
		|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ПО ПоручениеЭкспедиторуОснования.Основание = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
		|	И ПоручениеЭкспедиторуОснования.Ссылка = &Распоряжение";
		
		Запрос.УстановитьПараметр("Распоряжение", бит_Распоряжение);
	
	ИначеЕсли ТипЗнч(бит_Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.бит_КоличествоМест) КАК бит_КоличествоМест
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)";
		
		Запрос.УстановитьПараметр("Распоряжение", бит_Распоряжение);
	Иначе
		Возврат 0;
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.бит_КоличествоМест;
	КонецЦикла;
	
// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 13:49:38] -
КонецФункции
